// SPDX-License-Identifier: GPL-2.0-only
/* Driver for Analog Devices MS Plane Ethernet
 *
 * Copyright (C) 2022-2023 Analog Device Inc.
 */

#include <linux/types.h>
#include <linux/of_device.h>
#include <linux/netdevice.h>
#include <linux/etherdevice.h>
#include <linux/skbuff.h>
#include <linux/platform_device.h>
#include <linux/ethtool.h>
#include <linux/ip.h>
#include <linux/tcp.h>
#include <linux/adi_phc.h>

#define DRV_NAME	"adi-msp"
#define DRV_VERSION	"0.1"

#if IS_ENABLED(CONFIG_ADI_MSP_DEBUG)

#define MSP_DBG(...) trace_printk(__VA_ARGS__)
#define MSP_ERR(...) do {			\
	trace_printk(__VA_ARGS__);		\
	pr_err(__VA_ARGS__);			\
	tracing_off();				\
} while (0)

#else

#define MSP_DBG(...) do { } while (0)
#define MSP_ERR(...) pr_err(__VA_ARGS__)

#endif

#define MSP_INFO(...) pr_info(__VA_ARGS__)

/* Tx/Rx work unit type */
#define WU_TYPE_MASK		0x3
#define WU_TYPE_RX_DATA		1
#define WU_TYPE_RX_STAT		2
#define WU_TYPE_TX_DATA_SOF	1
#define WU_TYPE_TX_DATA_FUP	2
#define WU_TYPE_TX_STAT		3

#define RX_DATA_WU_HEADER_LEN	2
#define RX_DATA_WU_HEADER_SOF	(1 << 2)
#define RX_DATA_WU_HEADER_RESERVED_BITS 0xf8

#define RX_STAT_WU_HEADER_LEN	1
#define RX_STAT_WU_HEADER_ERR	(1 << 2)
#define RX_STAT_WU_HEADER_PORT	(1 << 3)
#define RX_STAT_WU_HEADER_DROPPED_ERR (1 << 4)
#define RX_STAT_WU_HEADER_RESERVED_BITS 0xe0

/* This is the header length for the first work unit for Tx.
 * NOTE
 * 1. Because the start of IP header is always aligned to 4 bytes and the
 *    Ethernet header is 14 bytes. We need to add a workunit header of 2 or 6
 *    bytes to make the work unit aligned to 4 bytes.
 * 2. For SKBs using paged data, we want to use one following work unit for
 *    each fragment. But it's impossible to add a header for such work unit
 *    without memory copy. Since we already provide the frame length in the
 *    header of the first work unit, we can tell the frame end by tracking
 *    how many bytes has been copied by DMA. So, we don't need a header for
 *    the work units following the first one.
 *    For now we are not going to support SKBs using paged data.
 */
struct tx_wu_header {
	u8 byte0;
	u8 frame_tag;
	u16 frame_len;
	u8 reserved[4];
};

#define TX_WU_HEADER_LEN	(sizeof(struct tx_wu_header))

#define TX_WU_PTP		(1 << 2)
#define TX_WU_PORT_0		(0 << 3)
#define TX_WU_PORT_1		(1 << 3)

/* Format of Tx/Rx status work unit */
struct status_wu_s {
	u8 byte0;
	u8 frame_tag;
	u8 timestamp[12];
	u16 frame_len;		/* Tx status wu: reserved */
};

/* 96-bit timestamp format
 *   [95:48]: seconds (48 bits)
 *   [47:16]: nanoseconds (32 bits)
 *   [15:0] : fractions of nanosecond (16 bits)
 * so in the following struct
 *   timestamp[0][7:0]  : byte0
 *   timestamp[0][16:8] : frame_tag
 *   timestamp[0][31:17]: fractions of nanosecond
 *   timestamp[1][31:0] : nanoseconds
 *   timestamp[2][31:0] : seconds[31:0]
 *   timestamp[3][15:0] : seconds[47:32]
 *   timestamp[3][32:16]: frame_len(Rx)/reserved(Tx)
 */
struct status_wu_t {
	u32 timestamp[4];
};

union status_wu {
	struct status_wu_s s;
	struct status_wu_t t;
};

#define STATUS_WU_LEN		(sizeof(union status_wu))

#define TX_STATUS_WU_ERR	(1 << 2)
#define TX_STATUS_WU_PTP	(1 << 3)

#define MSP_RST_CTRL		0x20103210
#define MSP_RST_CTRL_RX0	(1 << 0)
#define MSP_RST_CTRL_RX1	(1 << 1)
#define MSP_RST_CTRL_TX0	(1 << 2)
#define MSP_RST_CTRL_TX1	(1 << 3)

#define MSP_EN			(1 << 0)

#define MSP_RX_INT_FRAME_DROPPED	(1 << 0)
#define MSP_RX_INT_WORKUNIT_COMPLETE	(1 << 1)
#define MSP_RX_INT_STATUS_WR		(1 << 2)
#define MSP_RX_INT_CRC_ERR		(1 << 3)
#define MSP_RX_INT_FRAME_SIZE		(1 << 4)
#define MSP_RX_INT_ALL			0x1F

#define MSP_TX_INT_WU_HEADER_ERR	(1 << 0)
#define MSP_TX_INT_TX_WORKUNIT_COMPLETE	(1 << 1)
#define MSP_TX_INT_STATUS_WRITE_COMPLETE (1 << 2)
#define MSP_TX_INT_FRAME_SIZE		(1 << 3)
#define MSP_TX_INT_STATUS_FIFO_FULL	(1 << 4)
#define MSP_TX_INT_ALL			0x1F

struct msp_rx_regs {
	u32 stat_ctrl;
	u32 intr_en;
	u32 intr_stat;
	u32 frame_dropped_count_mplane;
	u32 frame_dropped_count_splane;
	u32 frame_size;
};

struct msp_tx_regs {
	u32 stat_ctrl;
	u32 intr_en;
	u32 intr_stat;
	u32 timeout_value;
	u32 frame_size;
};

struct dde_tester_regs {
	u32 ctrl;
};

/* Interrupt control register */
/* The base address is axi_palau_gpio module + 0x01D0 */
#define MSP_INT_CTRL_RX		0x0
#define MSP_INT_CTRL_TX		0x4
#define MSP_INT_CTRL_STATUS	0x8
#define MSP_INT_CTRL_DMADONE	(1 << 0)
#define MSP_INT_CTRL_DDE_ERR	(1 << 1)

#define DMA_STAT_PIRQ		(1 << 2)
#define DMA_STAT_IRQERR		(1 << 1)
#define DMA_STAT_IRQDONE	(1 << 0)
#define DMA_STAT_RUN(STAT)	(((STAT) >> 8) & 0x7)
#define DMA_STAT_HALT		0 /* IDLE or STOP */
#define DMA_STAT_DESC_FETCH	1 /* Descriptor Fetch */
#define DMA_STAT_DATA_TRANSFER	2 /* Data Transfer */
#define DMA_STAT_WAIT_FOR_TRIG	3 /* Wait for Trigger */
#define DMA_STAT_WAIT_FOR_WACK	4 /* Wait for Write ACK/FIFO Drain to Peri */

#define MSIZE01			0
#define MSIZE02			1
#define MSIZE04			2
#define MSIZE08			3
#define MSIZE16			4
#define MSIZE32			5

#define DMA_CFG_DESCIDCPY	(1 << 25)
#define DMA_CFG_INT_XCNT	(1 << 20)
#define DMA_CFG_INT_YCNT	(2 << 20)
#define DMA_CFG_INT_MASK	(3 << 20)
#define DMA_CFG_NDSIZE04	(3 << 16)
#define DMA_CFG_NDSIZE05	(4 << 16)
#define DMA_CFG_TWAIT		(1 << 15)
#define DMA_CFG_FLOW_STOP	(0 << 12)
#define DMA_CFG_FLOW_DSCL	(4 << 12)
#define DMA_CFG_FLOW_MASK	(7 << 12)
#define DMA_CFG_MSIZE01		(MSIZE01 << 8)
#define DMA_CFG_MSIZE02		(MSIZE02 << 8)
#define DMA_CFG_MSIZE04		(MSIZE04 << 8)
#define DMA_CFG_MSIZE08		(MSIZE08 << 8)
#define DMA_CFG_MSIZE16		(MSIZE16 << 8)
#define DMA_CFG_MSIZE32		(MSIZE32 << 8)
#define DMA_CFG_MSIZE_MASK	(7 << 8)
#define DMA_CFG_PSIZE01		(0 << 4)
#define DMA_CFG_PSIZE02		(1 << 4)
#define DMA_CFG_PSIZE04		(2 << 4)
#define DMA_CFG_PSIZE08		(3 << 4)
#define DMA_CFG_PSIZE_MASK	(7 << 4)
#define DMA_CFG_SYNC		(1 << 2)
#define DMA_CFG_READ		(0 << 1)
#define DMA_CFG_WRITE		(1 << 1)
#define DMA_CFG_EN		(1 << 0)

/* MSIZE and XMOD are dynamically calculated for TX DMA */
#define TX_DMA_CFG_COMMON \
	(DMA_CFG_DESCIDCPY | DMA_CFG_INT_XCNT | \
	 DMA_CFG_NDSIZE05 | DMA_CFG_PSIZE08 | \
	 DMA_CFG_SYNC | DMA_CFG_READ | DMA_CFG_EN)

#define RX_MSIZE		MSIZE08
#define RX_XMOD			(1 << RX_MSIZE)
#define RX_DMA_CFG_COMMON \
	(DMA_CFG_DESCIDCPY | DMA_CFG_INT_XCNT | \
	 DMA_CFG_NDSIZE05 | (RX_MSIZE << 8) | DMA_CFG_PSIZE08 | \
	 DMA_CFG_WRITE | DMA_CFG_EN)

#define STATUS_MSIZE		MSIZE08
#define STATUS_XMOD		(1 << STATUS_MSIZE)
#define STATUS_DMA_CFG_COMMON \
	(DMA_CFG_DESCIDCPY | DMA_CFG_INT_XCNT | \
	 DMA_CFG_NDSIZE05 | (STATUS_MSIZE << 8) | DMA_CFG_PSIZE04 | \
	 DMA_CFG_WRITE | DMA_CFG_EN)

/* DMA descriptor (in physical memory). */
struct dma_desc {
	u32 dscptr_nxt;
	u32 addrstart;
	u32 cfg;
	u32 xcnt;
	u32 xmod;
};

/* DMA register (within Internal Register Map).  */
struct dma_regs {
	u32 dscptr_nxt;		/* Pointer to next initial descriptor */
	u32 addrstart;		/* Start address of current buffer */
	u32 cfg;		/* Configuration */
	u32 xcnt;		/* Inner loop count start value */
	u32 xmod;		/* Inner loop address increment */
	u32 ycnt;		/* Outer loop count start value (2D only) */
	u32 ymod;		/* Outer loop address increment (2D only) */
	u32 dummy_1c;
	u32 dummy_20;
	u32 dscptr_cur;		/* Current descriptor pointer */
	u32 dscptr_prv;		/* Previous initial descriptor pointer */
	u32 addr_cur;		/* Current address */
	u32 stat;		/* Status */
	u32 xcnt_cur;		/* Current count (1D) or intra-row XCNT (2D) */
	u32 ycnt_cur;		/* Current row count (2D only) */
	u32 dummy_3c;
	u32 bwlcnt;             /* Bandwidth limit count */
	u32 bwlcnt_cur;         /* Bandwidth limit count current */
	u32 bwmcnt;             /* Bandwidth monitor count */
	u32 bwmcnt_cur;         /* Bandwidth monitor count current */
};

/* the following must be powers of two */
#define ADI_MSP_NUM_RDS		128  /* number of Rx descriptors */
#define ADI_MSP_NUM_TDS		128  /* number of Tx/Status descriptors */
#define ADI_MSP_NUM_SDS		ADI_MSP_NUM_TDS  /* number of Tx status descriptors */
#define ADI_MSP_RDS_MASK	(ADI_MSP_NUM_RDS - 1)
#define ADI_MSP_TDS_MASK	(ADI_MSP_NUM_TDS - 1)
#define ADI_MSP_SDS_MASK	(ADI_MSP_NUM_SDS - 1)
#define ADI_MSP_RD_RING_SIZE	(ADI_MSP_NUM_RDS * sizeof(struct dma_desc))
#define ADI_MSP_TD_RING_SIZE	(ADI_MSP_NUM_TDS * sizeof(struct dma_desc))
#define ADI_MSP_SD_RING_SIZE	(ADI_MSP_NUM_SDS * sizeof(struct dma_desc))

#if ADI_MSP_NUM_TDS != ADI_MSP_NUM_SDS
#error "Tx descriptors are not as many as Tx status descriptors"
#endif

/* Frame tag is an 8-bit field in work unit. It cannot be 0. So the number
 * of valid frame tags is 255.
 */
#define ADI_MSP_NUM_FRAME_TAGS		255
#define ADI_MSP_MIN_NONPTP_FRAME_TAG	1
#define ADI_MSP_MAX_NONPTP_FRAME_TAG	247
#define ADI_MSP_MIN_PTP_FRAME_TAG	(ADI_MSP_MAX_NONPTP_FRAME_TAG + 1)
#define ADI_MSP_MAX_PTP_FRAME_TAG	ADI_MSP_NUM_FRAME_TAGS

/* TODO  try threshold other than 1 */
#define ADI_MSP_STOP_QUEUE_TH	1

#define MTU			1500

#define TX_TIMEOUT_VALUE	0x100

/* If TX MAC does not do padding for us, we need to define this macro.
 * When this macro is define, the frame will be padded to at least 60 bytes.
 */
#ifdef CONFIG_ADI_MSP_TX_PADDING
#define TX_MIN_FRAME_SIZE	60U
#else
/* Intel E-Tile drops frames of less than nine bytes */
#define TX_MIN_FRAME_SIZE	9U
#endif
/* This includes optional 802.1Q tag */
#define TX_MAX_FRAME_SIZE	(MTU + 18)

/* Minimal length of Ethernet frame header */
#define RX_MIN_FRAME_SIZE	14
/* This includes optional 802.1Q tag */
#define RX_MAX_FRAME_SIZE	(MTU + 18)

#define RX_WU_LEN		1536

/* The size of array prev_rx_skb[] */
#define PREV_RX_SKB_NUM		6
/* How many data work units can be used for each frame.
 * Must be smaller than PREV_RX_SKB_NUM
 */
#define DATA_WU_PER_FRAME	DIV_ROUND_UP(RX_MAX_FRAME_SIZE, RX_WU_LEN)

#if DATA_WU_PER_FRAME >= PREV_RX_SKB_NUM
#error "PREV_RX_SKB_NUM should be larger than DATA_WU_PER_FRAME"
#endif

#if DATA_WU_PER_FRAME > 1
#error "Currently one Ethernet frame must fit into one data work unit"
#endif

/* This is used to assure Rx DMA buffers won't be adjacent to each other */
#define RX_WU_GUARD_SIZE	1
#define RX_WU_BUF_SIZE		(RX_WU_LEN + RX_WU_GUARD_SIZE)

/* This is used to assure Tx Status DMA buffers won't be adjacent to each other */
#define STATUS_WU_GUARD_SIZE	1
/* Must be a multiple of STATUS_XMOD since all Tx status workunit buffers are
 * allocated continuously.
 */
#define STATUS_WU_BUF_SIZE	round_up(STATUS_WU_LEN + STATUS_WU_GUARD_SIZE, \
					 STATUS_XMOD)

enum chain_status {
	FILLED,
	EMPTY
};

#define ADI_MSP_NL_STATS \
	ADI_MSP_NL_STAT(rx_packets) \
	ADI_MSP_NL_STAT(tx_packets) \
	ADI_MSP_NL_STAT(rx_bytes) \
	ADI_MSP_NL_STAT(tx_bytes) \
	ADI_MSP_NL_STAT(rx_errors) \
	ADI_MSP_NL_STAT(tx_errors) \
	ADI_MSP_NL_STAT(rx_dropped) \
	ADI_MSP_NL_STAT(tx_dropped) \
	ADI_MSP_NL_STAT(multicast) \
	ADI_MSP_NL_STAT(collisions) \
	ADI_MSP_NL_STAT(rx_length_errors) \
	ADI_MSP_NL_STAT(rx_over_errors) \
	ADI_MSP_NL_STAT(rx_crc_errors) \
	ADI_MSP_NL_STAT(rx_frame_errors) \
	ADI_MSP_NL_STAT(rx_fifo_errors) \
	ADI_MSP_NL_STAT(rx_missed_errors) \
	ADI_MSP_NL_STAT(tx_aborted_errors) \
	ADI_MSP_NL_STAT(tx_carrier_errors) \
	ADI_MSP_NL_STAT(tx_fifo_errors) \
	ADI_MSP_NL_STAT(tx_heartbeat_errors) \
	ADI_MSP_NL_STAT(tx_window_errors) \
	ADI_MSP_NL_STAT(tx_reset) \
	ADI_MSP_NL_STAT(rx_reset)

#define INTEL_ETILE_TX_STATS \
	INTEL_ETILE_STAT(tx_fragments, 0x800) \
	INTEL_ETILE_STAT(tx_jabbers, 0x802) \
	INTEL_ETILE_STAT(tx_fcs_errors, 0x804) \
	INTEL_ETILE_STAT(tx_crc_errors, 0x806) \
	INTEL_ETILE_STAT(tx_errored_multicast, 0x808) \
	INTEL_ETILE_STAT(tx_errored_broadcast, 0x80a) \
	INTEL_ETILE_STAT(tx_errored_unicast, 0x80c) \
	INTEL_ETILE_STAT(tx_err_mcast_ctrl_frames, 0x80e) \
	INTEL_ETILE_STAT(tx_err_bcast_ctrl_frames, 0x810) \
	INTEL_ETILE_STAT(tx_err_ucast_ctrl_frames, 0x812) \
	INTEL_ETILE_STAT(tx_pause_errors, 0x814) \
	INTEL_ETILE_STAT(tx_64byte_frames, 0x816) \
	INTEL_ETILE_STAT(tx_65to127bytes_frames, 0x818) \
	INTEL_ETILE_STAT(tx_128to255bytes_frames, 0x81a) \
	INTEL_ETILE_STAT(tx_256to511bytes_frames, 0x81c) \
	INTEL_ETILE_STAT(tx_512to1023bytes_frames, 0x81e) \
	INTEL_ETILE_STAT(tx_1024to1518bytes_frames, 0x820) \
	INTEL_ETILE_STAT(tx_1519tomax_frames, 0x822) \
	INTEL_ETILE_STAT(tx_oversize_frames, 0x824) \
	INTEL_ETILE_STAT(tx_multicast_frames, 0x826) \
	INTEL_ETILE_STAT(tx_broadcast_frames, 0x828) \
	INTEL_ETILE_STAT(tx_unicast_frames, 0x82a) \
	INTEL_ETILE_STAT(tx_multicast_ctrl_frames, 0x82c) \
	INTEL_ETILE_STAT(tx_broadcast_ctrl_frames, 0x82e) \
	INTEL_ETILE_STAT(tx_unicast_ctrl_frames, 0x830) \
	INTEL_ETILE_STAT(tx_pause_frames, 0x832) \
	INTEL_ETILE_STAT(tx_runt_packets, 0x834) \
	INTEL_ETILE_STAT(tx_frame_starts, 0x836) \
	INTEL_ETILE_STAT(tx_length_errored_frames, 0x838) \
	INTEL_ETILE_STAT(tx_prc_errored_frames, 0x83a) \
	INTEL_ETILE_STAT(tx_prc_frames, 0x83c) \
	INTEL_ETILE_STAT(tx_payload_bytes, 0x860) \
	INTEL_ETILE_STAT(tx_bytes, 0x862) \
	INTEL_ETILE_STAT(tx_errors, 0x864) \
	INTEL_ETILE_STAT(tx_dropped, 0x866) \
	INTEL_ETILE_STAT(tx_bad_length_type_frames, 0x868)

#define INTEL_ETILE_RX_STATS \
	INTEL_ETILE_STAT(rx_fragments, 0x900) \
	INTEL_ETILE_STAT(rx_jabbers, 0x902) \
	INTEL_ETILE_STAT(rx_fcs_errors, 0x904) \
	INTEL_ETILE_STAT(rx_crc_errors, 0x906) \
	INTEL_ETILE_STAT(rx_errored_multicast, 0x908) \
	INTEL_ETILE_STAT(rx_errored_broadcast, 0x90a) \
	INTEL_ETILE_STAT(rx_errored_unicast, 0x90c) \
	INTEL_ETILE_STAT(rx_err_mcast_ctrl_frames, 0x90e) \
	INTEL_ETILE_STAT(rx_err_bcast_ctrl_frames, 0x910) \
	INTEL_ETILE_STAT(rx_err_ucast_ctrl_frames, 0x912) \
	INTEL_ETILE_STAT(rx_pause_errors, 0x914) \
	INTEL_ETILE_STAT(rx_64byte_frames, 0x916) \
	INTEL_ETILE_STAT(rx_65to127bytes_frames, 0x918) \
	INTEL_ETILE_STAT(rx_128to255bytes_frames, 0x91a) \
	INTEL_ETILE_STAT(rx_256to511bytes_frames, 0x91c) \
	INTEL_ETILE_STAT(rx_512to1023bytes_frames, 0x91e) \
	INTEL_ETILE_STAT(rx_1024to1518bytes_frames, 0x920) \
	INTEL_ETILE_STAT(rx_1519tomax_frames, 0x922) \
	INTEL_ETILE_STAT(rx_oversize_frames, 0x924) \
	INTEL_ETILE_STAT(rx_multicast_frames, 0x926) \
	INTEL_ETILE_STAT(rx_broadcast_frames, 0x928) \
	INTEL_ETILE_STAT(rx_unicast_frames, 0x92a) \
	INTEL_ETILE_STAT(rx_multicast_ctrl_frames, 0x92c) \
	INTEL_ETILE_STAT(rx_broadcast_ctrl_frames, 0x92e) \
	INTEL_ETILE_STAT(rx_unicast_ctrl_frames, 0x930) \
	INTEL_ETILE_STAT(rx_pause_frames, 0x932) \
	INTEL_ETILE_STAT(rx_runt_packets, 0x934) \
	INTEL_ETILE_STAT(rx_frame_starts, 0x936) \
	INTEL_ETILE_STAT(rx_length_errored_frames, 0x938) \
	INTEL_ETILE_STAT(rx_prc_errored_frames, 0x93a) \
	INTEL_ETILE_STAT(rx_prc_frames, 0x93c) \
	INTEL_ETILE_STAT(rx_payload_bytes, 0x960) \
	INTEL_ETILE_STAT(rx_bytes, 0x962)

#define ADI_BRIDGE_MAC_OIF_STATS \
	ADI_BRIDGE_MAC_OIF_STAT(rx_mac_pkt_cnt, 0x28) \
	ADI_BRIDGE_MAC_OIF_STAT(tx_mac_pkt_cnt, 0x2c) \
	ADI_BRIDGE_MAC_OIF_STAT(rx_oif_pkt_cnt, 0x30) \
	ADI_BRIDGE_MAC_OIF_STAT(tx_oif_pkt_cnt, 0x34) \
	ADI_BRIDGE_MAC_OIF_STAT(rx_block_dropped_cnt, 0x38) \
	ADI_BRIDGE_MAC_OIF_STAT(tx_block_dropped_cnt, 0x3c)

/* ADI OIF TX */
#define ADI_OIF_TX_STATS \
	ADI_OIF_STAT(tx_frames, 0x34) \
	ADI_OIF_STAT(tx_preemption_frames, 0x38)

/* ADI OIF RX */
#define ADI_OIF_RX_STATS \
	ADI_OIF_STAT(rx_frames, 0x14) \
	ADI_OIF_STAT(rx_sw_frames, 0x70)

/* ADI Async FIFO RX */
#define ADI_ASYNC_FIFO_RX_STATS \
	ADI_ASYNC_FIFO_STAT(rx_dropped, 0x10)

/* ADI MSP RX */
#define ADI_MSP_RX_STATS \
	ADI_MSP_STAT(rx_dropped_mplane, 0xc) \
	ADI_MSP_STAT(rx_dropped_splane, 0x10)

struct adi_msp_nl_stats {
#define ADI_MSP_NL_STAT(S) u64 S;
	ADI_MSP_NL_STATS
#undef ADI_MSP_NL_STAT
};

struct intel_etile_tx_stats {
#define INTEL_ETILE_STAT(S, OFFSET) u64 S;
	INTEL_ETILE_TX_STATS
#undef INTEL_ETILE_STAT
};

struct intel_etile_rx_stats {
#define INTEL_ETILE_STAT(S, OFFSET) u64 S;
	INTEL_ETILE_RX_STATS
#undef INTEL_ETILE_STAT
};

struct adi_bridge_mac_oif_stats {
#define ADI_BRIDGE_MAC_OIF_STAT(S, OFFSET) u64 S;
	ADI_BRIDGE_MAC_OIF_STATS
#undef ADI_BRIDGE_MAC_OIF_STAT
};

struct adi_oif_tx_stats {
#define ADI_OIF_STAT(S, OFFSET) u64 S;
	ADI_OIF_TX_STATS
#undef ADI_OIF_STAT
};

struct adi_oif_rx_stats {
#define ADI_OIF_STAT(S, OFFSET) u64 S;
	ADI_OIF_RX_STATS
#undef ADI_OIF_STAT
};

#ifndef CONFIG_ADI_MSPRX_ASYNC_FIFO
struct adi_async_fifo_rx_stats {
#define ADI_ASYNC_FIFO_STAT(S, OFFSET) u64 S;
	ADI_ASYNC_FIFO_RX_STATS
#undef ADI_ASYNC_FIFO_STAT
};
#endif

struct adi_msp_rx_stats {
#define ADI_MSP_STAT(S, OFFSET) u64 S;
	ADI_MSP_RX_STATS
#undef ADI_MSP_STAT
};

struct adi_msp_stats {
	struct adi_msp_nl_stats		nl;
	struct intel_etile_tx_stats	etile_tx;
	struct intel_etile_rx_stats	etile_rx;
	struct adi_bridge_mac_oif_stats	bridge_mac_oif;
	struct adi_oif_tx_stats		oif_tx;
	struct adi_oif_rx_stats		oif_rx;
#ifndef CONFIG_ADI_MSPRX_ASYNC_FIFO
	struct adi_async_fifo_rx_stats	async_fifo_rx;
#endif
	struct adi_msp_rx_stats		msp_rx;
};

struct oif_tx_regs {
	u32 irq_event;		// 0x0
	u32 irq_mask;		// 0x4
	u32 irq_status;		// 0x8
	u32 dummy_c;		// 0xc
	u32 dummy_10;		// 0x10
	u32 dummy_14;		// 0x14
	u32 dummy_18;		// 0x18
	u32 dummy_1c;		// 0x1c
	u32 cfg_ip_headers;	// 0x20
	u32 dummy_24;		// 0x24
	u32 dummy_28;		// 0x28
	u32 dummy_2c;		// 0x2c
	u32 cfg_cdc_flow_ctrl;	// 0x30
	u32 stat_tx_pckt;	// 0x34
	u32 stat_pre_tx_pckt;	// 0x38
	u32 cfg_tx;		// 0x3c
	u32 cfg_tx_smac_0;	// 0x40
	u32 cfg_tx_smac_1;	// 0x44
	u32 cfg_tx_dip6_0;	// 0x48
	u32 cfg_tx_dip6_1;	// 0x4c
	u32 cfg_tx_dip6_2;	// 0x50
	u32 cfg_tx_dip6_3;	// 0x54
	u32 cfg_tx_sip6_0;	// 0x58
	u32 cfg_tx_sip6_1;	// 0x5c
	u32 cfg_tx_sip6_2;	// 0x60
	u32 cfg_tx_sip6_3;	// 0x64
};

struct oif_rx_regs {
	u32 irq_event;		// 0x0
	u32 irq_mask;		// 0x4
	u32 irq_status;		// 0x8
	u32 dummy_c;		// 0xc
	u32 ecpriid_nmatch;	// 0x10
	u32 stat_pck;		// 0x14
	u32 dummy_18;		// 0x18
	u32 dummy_1c;		// 0x1c
	u32 cfg_eaxc_en[8];	// 0x20
	u32 rx_ctrl;		// 0x40 : [4] ip_prom_mode
				//	  [0] rx_en
	u32 cfg_fr_mux_smac_0;	// 0x44 : [31:0] LSBs of 48-bit MAC addr
	u32 cfg_fr_mux_smac_1;	// 0x48 : [16] prom_mode
				//	  [15:0] MSBs of 48-bit MAC addr
	u32 dummy_4c;		// 0x4c
	u32 dummy_50;		// 0x50
	u32 dummy_54;		// 0x54
	u32 dummy_58;		// 0x58
	u32 dummy_5c;		// 0x5c
	u32 dummy_60;		// 0x60
	u32 cfg_ip_addr;	// 0x64 : [31:0] IP addr for frame mux
	u32 cfg_udp_port;	// 0x68 : [16] wildcard
				//	  [15:0] UDP Port for frame mux
	u32 dummy_6c;		// 0x6c
	u32 stat_sw_pck;	// 0x70
	u32 dummy_74;		// 0x74
	u32 dummy_78;		// 0x78
	u32 dummy_7c;		// 0x7c
	u32 stat_dmap_pck[2];	// 0x80
	u32 dummy_88;		// 0x88
	u32 dummy_8c;		// 0x8c
	u32 cfg_ipv6_addr_0;	// 0x90
	u32 cfg_ipv6_addr_1;	// 0x94
	u32 cfg_ipv6_addr_2;	// 0x98
	u32 cfg_ipv6_addr_3;	// 0x9c
};

/* Information that need to be kept for each board. */
struct adi_msp_private {
	struct msp_rx_regs __iomem *rx_regs;
	struct msp_tx_regs __iomem *tx_regs;
	struct dde_tester_regs __iomem *dde_tester_regs;
	struct dma_regs __iomem *rx_dma_regs;
	struct dma_regs __iomem *tx_dma_regs;
	struct dma_regs __iomem *status_dma_regs;
	struct oif_rx_regs __iomem *oif_rx_regs;
	struct oif_tx_regs __iomem *oif_tx_regs;
	void __iomem *axi_palau_gpio_msp_ctrl;
	void __iomem *bridge_tx_regs;
	void __iomem *bridge_rx_regs;
	void __iomem *etile_regs;
#ifndef CONFIG_ADI_MSPRX_ASYNC_FIFO
	void __iomem *async_fifo_rx_regs;
#endif

	struct dma_desc *td_ring; /* transmit descriptor ring */
	struct dma_desc *rd_ring; /* receive descriptor ring  */
	struct dma_desc *sd_ring; /* status descriptor ring  */
	dma_addr_t td_dma;
	dma_addr_t rd_dma;
	dma_addr_t sd_dma;

	struct sk_buff *tx_skb[ADI_MSP_NUM_TDS];
	struct sk_buff *rx_skb[ADI_MSP_NUM_RDS];
	u8 *status_wu;

